titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [191]:
import pandas as pd
train_df = pd.read_csv("train.csv")
missing_df = pd.read_csv("train_missing.csv")
display(train_df)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [192]:
train_df[train_df["Survived"] == 0]["Age"].mean()

30.62617924528302

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [193]:
x = train_df[train_df["Survived"] == 0]["Fare"].describe()
print("Mean:", x[1],"\nMedian:", x[5])

Mean: 22.117886885245877
Median: 10.5

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [194]:
train_df.query("Survived == 0 and Sex == 'male'")["Age"].mean()

31.618055555555557

Kazada ölen Kadınların yaş ortalamasını bulunuz

In [195]:
train_df.query("Survived == 0 and Sex == 'female'")["Age"].mean()

25.046875

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [196]:
train_df[train_df["Survived"] == 1]["Age"].mean()

28.343689655172415

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [197]:
train_df[train_df["Survived"] == 1]["Fare"].mean()

48.39540760233917

Kazadan kurtulan toplam kişi sayısını bulunuz

In [198]:
train_df.Survived.value_counts()[1]

342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [199]:
train_df.query("Survived == 1 and Sex == 'male'")["Age"].mean()

27.276021505376345

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

In [200]:
train_df.query("Survived == 1 and Sex == 'female'")["Age"].mean()

28.84771573604061

# Soru 3:

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [201]:
train_df.query("Age < 10")["Fare"].median()

27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [202]:
train_df.query("Age > 10")["Fare"].median()

13.92915

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [203]:
p1 = (len(train_df.query("Pclass==1 and Survived==0")) / len(train_df.query("Pclass==1")))*100
p2 = (len(train_df.query("Pclass==2 and Survived==0")) / len(train_df.query("Pclass==2")))*100
p3 = (len(train_df.query("Pclass==3 and Survived==0")) / len(train_df.query("Pclass==3")))*100
print("1.Sınıf: %{:.2f}\n2.Sınıf: %{:.2f}\n3.Sınıf: %{:.2f}".format(p1,p2,p3))
print("1. sınıftan 3. sınıfa doğru gittikçe ölüm oranı gözle görülür bir biçimde yükselmiş.")

1.Sınıf: %37.04
2.Sınıf: %52.72
3.Sınıf: %75.76
1. sınıftan 3. sınıfa doğru gittikçe ölüm oranı gözle görülür bir biçimde yükselmiş.

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [204]:
pf1 = train_df.query("Pclass==1")["Fare"].mean()
pf2 = train_df.query("Pclass==2")["Fare"].mean()
pf3 = train_df.query("Pclass==3")["Fare"].mean()
print("1.Sınıf: {:.2f}\n2.Sınıf: {:.2f}\n3.Sınıf: {:.2f}".format(pf1,pf2,pf3))

1.Sınıf: 84.15
2.Sınıf: 20.66
3.Sınıf: 13.68

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [222]:
display(len(train_df.query("Survived==0 and Sex=='female'")) / len(train_df.query("Sex=='female'")))
display(len(train_df.query("Survived==0 and Sex=='male'")) / len(train_df.query("Sex=='male'")))
print("Ölen erkeklerin oranı ölmeyenlerin 4 katından biraz daha fazla, ancak kadınlarda ise durum tam dersi.\nAslında beklenmedik olmayan bir sonuç bu bana göre çünkü orta yaştaki çoğu erkek yaşlı, kadın ve çocukların kurtulabilmesi için kendini feda etmiş.")

0.25796178343949044

0.8110918544194108

Ölen erkeklerin oranı ölmeyenlerin 4 katından biraz daha fazla, ancak kadınlarda ise durum tam dersi.
Aslında beklenmedik olmayan bir sonuç bu bana göre çünkü orta yaştaki çoğu erkek yaşlı, kadın ve çocukların kurtulabilmesi için kendini feda etmiş.

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [206]:
display(train_df.query("Survived==0 and Sex=='male'")["Fare"].mean())
display(train_df.query("Survived==1 and Sex=='male'")["Fare"].mean())
print("Hayatta kalan erkeklerin bilet fiyatlarının ortalamaları daha yüksek. \nYani yukarıda da gördüğümüz gibi sınıfı daha iyi olan insanların hayatta kalma olasılıkları daha yüksek oluyor.")

21.960992948717944

40.82148440366974

Hayatta kalan erkeklerin bilet fiyatlarının ortalamaları daha yüksek.
Yani yukarıda da gördüğümüz gibi sınıfı daha iyi olan insanların hayatta kalma olasılıkları daha yüksek oluyor.

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

# Soru 8

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

In [207]:
missing_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked       173
dtype: int64

In [209]:
missing_df["Age"].fillna(value=missing_df["Age"].mean(), inplace=True)
missing_df["Embarked"].fillna(value=missing_df["Embarked"].mode()[0], inplace=True)
missing_df["Fare"].fillna(value=missing_df["Fare"].mean(), inplace=True)

In [210]:
missing_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp          170
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

In [212]:
missing_df.query("Age<=18")["SibSp"].describe()

count    119.000000
mean       1.201681
std        1.504681
min        0.000000
25%        0.000000
50%        1.000000
75%        2.000000
max        5.000000
Name: SibSp, dtype: float64

In [213]:
missing_df.query("Age<18")["SibSp"].value_counts()

0.0    38
1.0    29
4.0    16
2.0     5
3.0     5
5.0     3
Name: SibSp, dtype: int64

In [214]:
missing_df.query("Age>18 and Sex=='male'")["SibSp"].describe()

count    405.000000
mean       0.293827
std        0.909295
min        0.000000
25%        0.000000
50%        0.000000
75%        0.000000
max        8.000000
Name: SibSp, dtype: float64

In [215]:
missing_df.query("Age>18")["SibSp"].value_counts()

0.0    436
1.0    138
2.0     14
8.0      7
3.0      7
Name: SibSp, dtype: int64

In [221]:
print("18 yaşından küçüklerin kardeş sayısı 18'den büyüklere göre daha fazla yukarıdaki çıktılardan da gördüğümüz gibi.\nBu yüzden 18 yaşından küçükleri 1 ile 18 yaşından büyükleri de 0 ile dolduracağım")
missing_df.loc[missing_df["Age"]<=18, "SibSp"] = missing_df.loc[missing_df["Age"]<=18, "SibSp"].fillna(value=1.0)
missing_df.loc[missing_df["Age"]>18, "SibSp"] = missing_df.loc[missing_df["Age"]>18, "SibSp"].fillna(value=0.0)
missing_df["SibSp"].isnull().sum()

18 yaşından küçüklerin kardeş sayısı 18'den büyüklere göre daha fazla yukarıdaki çıktılardan da gördüğümüz gibi.
Bu yüzden 18 yaşından küçükleri 1 ile 18 yaşından büyükleri de 0 ile dolduracağım

0

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [218]:
missing_df2 = pd.read_csv("train_missing.csv")
missing_df2["Embarked"].fillna(value="NAN", inplace=True)

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [219]:
idx = missing_df2[missing_df2["Fare"].isnull()].index

In [220]:
missing_df2["Fare_Missing"] = 0
missing_df2.loc[idx, "Fare_Missing"] = 1
missing_df2["Fare"].fillna(value=missing_df2["Fare"].median(), inplace=True)
display(missing_df2)

     PassengerId  Survived  Pclass  ... Cabin Embarked  Fare_Missing
0              1         0       3  ...   NaN        S             0
1              2         1       1  ...   C85        C             0
2              3         1       3  ...   NaN      NAN             0
3              4         1       1  ...  C123        S             0
4              5         0       3  ...   NaN      NAN             0
..           ...       ...     ...  ...   ...      ...           ...
886          887         0       2  ...   NaN        S             0
887          888         1       1  ...   B42        S             0
888          889         0       3  ...   NaN        S             1
889          890         1       1  ...  C148      NAN             0
890          891         0       3  ...   NaN        Q             0

[891 rows x 13 columns]